; domain
;; Enrico Scala (enricos83@gmail.com)
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;; counters-ineq-rnd domain, functional strips version
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;; This domain describes a set of counters that can be increased and decreased. The rate of such counter is however variable!

(define (domain fo-counters-rnd)
    (:requirements :strips :typing :fluents :adl)
    (:types counter)

    (:functions
        (value ?c - counter);; - int  ;; The value shown in counter ?c
        (rate_value ?c - counter);;
        (max_int);; -  int ;; The maximum integer we consider - a static value
    )

    ;; Increment the value in the given counter by one
    (:action increment
         :parameters (?c - counter)
         :precondition (and (<= (+ (value ?c) (rate_value ?c)) (max_int)))
         :effect (and (increase (value ?c) (rate_value ?c)))
    )
    ;; Decrement the value in the given counter by one
    (:action decrement
         :parameters (?c - counter)
         :precondition (and (>= (- (value ?c) (rate_value ?c)) 0))
         :effect (and (decrease (value ?c) (rate_value ?c)))
    )

    (:action increase_rate
         :parameters (?c - counter)
         :precondition (and (<= (+ (rate_value ?c) 1) 10))
         :effect (and (increase (rate_value ?c) 1))
    )

    (:action decrement_rate
         :parameters (?c - counter)
         :precondition (and (>= (rate_value ?c) 1))
         :effect (and (decrease (rate_value ?c) 1))
    )


)

; problem
;; Enrico Scala (enricos83@gmail.com) and Miquel Ramirez (miquel.ramirez@gmail.com)
(define (problem instance_6_100)
	(:domain fo-counters-rnd)
	(:objects
		c0 c1 c2 c3 c4 c5 - counter
	)
  (:init
		(= (value c0) 91)
	(= (value c1) 30)
	(= (value c2) 96)
	(= (value c3) 30)
	(= (value c4) 81)
	(= (value c5) 84)

        (= (rate_value c0) 0)
	(= (rate_value c1) 0)
	(= (rate_value c2) 0)
	(= (rate_value c3) 0)
	(= (rate_value c4) 0)
	(= (rate_value c5) 0)

		(= (max_int) 100)
	)
	(:goal
		(and
			(<= (+ (value c0) 1) (value c1))
	(<= (+ (value c1) 1) (value c2))
	(<= (+ (value c2) 1) (value c3))
	(<= (+ (value c3) 1) (value c4))
	(<= (+ (value c4) 1) (value c5))
		)
	)
)

; plan
1. (increase_rate c1)
   changed: (rate_value c1) from 0 to 1
   goals met: 3 of 5
2. (increase_rate c0)
   changed: (rate_value c0) from 0 to 1
   goals met: 3 of 5
3. (increase_rate c1)
   changed: (rate_value c1) from 1 to 2
   goals met: 3 of 5
4. (increase_rate c1)
   changed: (rate_value c1) from 2 to 3
   goals met: 3 of 5
5. (increase_rate c1)
   changed: (rate_value c1) from 3 to 4
   goals met: 3 of 5
6. (increase_rate c1)
   changed: (rate_value c1) from 4 to 5
   goals met: 3 of 5
7. (increase_rate c0)
   changed: (rate_value c0) from 1 to 2
   goals met: 3 of 5
8. (increase_rate c1)
   changed: (rate_value c1) from 5 to 6
   goals met: 3 of 5
9. (increase_rate c0)
   changed: (rate_value c0) from 2 to 3
   goals met: 3 of 5
10. (increase_rate c0)
   changed: (rate_value c0) from 3 to 4
   goals met: 3 of 5
11. (increase_rate c1)
   changed: (rate_value c1) from 6 to 7
   goals met: 3 of 5
12. (increment c1)
   changed: (value c1) from 30 to 37
   goals met: 3 of 5
13. (increase_rate c1)
   changed: (rate_value c1) from 7 to 8
   goals met: 3 of 5
14. (increment c1)
   changed: (value c1) from 37 to 45
   goals met: 3 of 5
15. (increment c1)
   changed: (value c1) from 45 to 53
   goals met: 3 of 5
16. (increment c1)
   changed: (value c1) from 53 to 61
   goals met: 3 of 5
17. (increment c1)
   changed: (value c1) from 61 to 69
   goals met: 3 of 5
18. (increase_rate c1)
   changed: (rate_value c1) from 8 to 9
   goals met: 3 of 5
19. (increase_rate c1)
   changed: (rate_value c1) from 9 to 10
   goals met: 3 of 5
20. (increment c1)
   changed: (value c1) from 69 to 79
   goals met: 3 of 5
21. (increment c1)
   changed: (value c1) from 79 to 89
   goals met: 3 of 5
22. (decrement c0)
   changed: (value c0) from 91 to 87
   goals met: 4 of 5
23. (increase_rate c3)
   changed: (rate_value c3) from 0 to 1
   goals met: 4 of 5
24. (increase_rate c3)
   changed: (rate_value c3) from 1 to 2
   goals met: 4 of 5
25. (increase_rate c3)
   changed: (rate_value c3) from 2 to 3
   goals met: 4 of 5
26. (increase_rate c3)
   changed: (rate_value c3) from 3 to 4
   goals met: 4 of 5
27. (increase_rate c3)
   changed: (rate_value c3) from 4 to 5
   goals met: 4 of 5
28. (increase_rate c3)
   changed: (rate_value c3) from 5 to 6
   goals met: 4 of 5
29. (increase_rate c3)
   changed: (rate_value c3) from 6 to 7
   goals met: 4 of 5
30. (increment c3)
   changed: (value c3) from 30 to 37
   goals met: 4 of 5
31. (increase_rate c3)
   changed: (rate_value c3) from 7 to 8
   goals met: 4 of 5
32. (increase_rate c3)
   changed: (rate_value c3) from 8 to 9
   goals met: 4 of 5
33. (increment c3)
   changed: (value c3) from 37 to 46
   goals met: 4 of 5
34. (increment c3)
   changed: (value c3) from 46 to 55
   goals met: 4 of 5
35. (increment c3)
   changed: (value c3) from 55 to 64
   goals met: 4 of 5
36. (increase_rate c2)
   changed: (rate_value c2) from 0 to 1
   goals met: 4 of 5
37. (increase_rate c2)
   changed: (rate_value c2) from 1 to 2
   goals met: 4 of 5
38. (increment c3)
   changed: (value c3) from 64 to 73
   goals met: 4 of 5
39. (increase_rate c3)
   changed: (rate_value c3) from 9 to 10
   goals met: 4 of 5
40. (increment c3)
   changed: (value c3) from 73 to 83
   goals met: 3 of 5
41. (decrement c2)
   changed: (value c2) from 96 to 94
   goals met: 3 of 5
42. (increment c3)
   changed: (value c3) from 83 to 93
   goals met: 3 of 5
43. (increase_rate c4)
   changed: (rate_value c4) from 0 to 1
   goals met: 3 of 5
44. (increase_rate c4)
   changed: (rate_value c4) from 1 to 2
   goals met: 3 of 5
45. (increase_rate c4)
   changed: (rate_value c4) from 2 to 3
   goals met: 3 of 5
46. (decrement c2)
   changed: (value c2) from 94 to 92
   goals met: 4 of 5
47. (increment c4)
   changed: (value c4) from 81 to 84
   goals met: 3 of 5
48. (decrement c3)
   changed: (value c3) from 93 to 83
   goals met: 3 of 5
49. (decrement c2)
   changed: (value c2) from 92 to 90
   goals met: 3 of 5
50. (decrement c2)
   changed: (value c2) from 90 to 88
   goals met: 2 of 5
51. (decrement c2)
   changed: (value c2) from 88 to 86
   goals met: 2 of 5
52. (decrement c2)
   changed: (value c2) from 86 to 84
   goals met: 2 of 5
53. (decrement c2)
   changed: (value c2) from 84 to 82
   goals met: 3 of 5
54. (decrement c1)
   changed: (value c1) from 89 to 79
   goals met: 3 of 5
55. (decrement c0)
   changed: (value c0) from 87 to 83
   goals met: 3 of 5
56. (decrement c0)
   changed: (value c0) from 83 to 79
   goals met: 3 of 5
57. (decrement c0)
   changed: (value c0) from 79 to 75
   goals met: 4 of 5
58. (decrement c4)
   changed: (value c4) from 84 to 81
   goals met: 4 of 5
59. (decrement c3)
   changed: (value c3) from 83 to 73
   goals met: 4 of 5
60. (decrement c2)
   changed: (value c2) from 82 to 80
   goals met: 4 of 5
61. (decrement c2)
   changed: (value c2) from 80 to 78
   goals met: 3 of 5
62. (decrement c2)
   changed: (value c2) from 78 to 76
   goals met: 3 of 5
63. (decrement c2)
   changed: (value c2) from 76 to 74
   goals met: 3 of 5
64. (decrement c2)
   changed: (value c2) from 74 to 72
   goals met: 4 of 5
65. (decrement c1)
   changed: (value c1) from 79 to 69
   goals met: 4 of 5
66. (decrement c0)
   changed: (value c0) from 75 to 71
   goals met: 4 of 5
67. (decrement c0)
   changed: (value c0) from 71 to 67
   goals met: 5 of 5
